In [1]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [4]:
titles = pd.read_csv('data/titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [5]:
cast = pd.read_csv('data/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Using groupby(), count the number of films that have been released in each decade in the history of cinema.

In [34]:
film_releases_decade = cast.groupby(titles.year // 10 * 10).year.count().rename_axis('decade').to_frame('Total_Films')
film_releases_decade

        Total_Films
decade
1890.0            3
1900.0           37
1910.0         6512
1920.0         8797
1930.0        10097
1940.0         8576
1950.0        12711
1960.0        17515
1970.0        18714
1980.0        20243
1990.0        22225
2000.0        38713
2010.0        67977
2020.0          210

### Use groupby() count the number of "Hamlet" films made in each decade.

In [31]:
hamlet_film_decade = titles.loc[cast.title == 'Hamlet'].groupby(titles.year // 10 * 10).title.count()\
                        .rename_axis('decade').to_frame('total_movies')
hamlet_film_decade

        total_movies
decade
1920               2
1940               1
1960               3
1970               2
1980               1
1990               2
2000               6
2010               6

### How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [81]:
leading_roles = cast.loc[(cast['n'] == 1) & (cast['year'].between(1950, 1959))].groupby(['year','type']).n.count()
leading_roles

year  type
1950  actor      626
      actress    281
1951  actor      647
      actress    281
1952  actor      607
      actress    293
1953  actor      652
      actress    301
1954  actor      634
      actress    310
1955  actor      641
      actress    281
1956  actor      643
      actress    305
1957  actor      735
      actress    301
1958  actor      710
      actress    295
1959  actor      721
      actress    317
Name: n, dtype: int64

### In the 1950s taken as a whole, how many total roles were available to actors, and how many to actresses, for each "n" number 1 through 5?

In [64]:
actors_roles_1950s = cast.loc[(cast['type'] == 'actor') & (cast['year'].between(1950,1959)) & cast['n'].between(1,5)]\
                    .groupby('n').n.count().rename_axis('role').to_frame('total')

In [65]:
actors_roles_1950s

      total
role
1.0    6616
2.0    4564
3.0    5587
4.0    5594
5.0    5611

### Use groupby() to determine how many roles are listed for each of the Pink Panther movies.

In [85]:
list_roles = cast[cast['title'].str.contains('Pink Panther')].groupby('title').character.count().to_frame('Total_roles')
list_roles

                                Total_roles
title
Curse of the Pink Panther                67
Revenge of the Pink Panther              64
Son of the Pink Panther                  46
The Pink Panther                        111
The Pink Panther 2                       84
The Pink Panther Strikes Again           68
The Return of the Pink Panther           30
Trail of the Pink Panther                41

### List, in order by year, each of the films in which Frank Oz has played more than 1 role.

In [136]:
films_Frank_Oz_years = cast.loc[(cast['name'] == 'Frank Oz')].groupby(['year','title']).character.count()\
                        .to_frame('total-roles').sort_values(by='total-roles')
films_Frank_Oz_years = films_Frank_Oz_years.loc[films_Frank_Oz_years['total-roles'] > 1].sort_values(by='total-roles',ascending=False)
films_Frank_Oz_years

                                           total-roles
year title
1979 The Muppet Movie                                8
1984 The Muppets Take Manhattan                      7
1992 The Muppet Christmas Carol                      7
1981 The Great Muppet Caper                          6
1996 Muppet Treasure Island                          4
1999 Muppets from Space                              4
     The Adventures of Elmo in Grouchland            3
1985 Follow That Bird                                3
1982 The Dark Crystal                                2
1981 An American Werewolf in London                  2

### List each of the characters that Frank Oz has portrayed at least twice.

In [147]:
character_Frank_Oz_years = cast.loc[(cast['name'] == 'Frank Oz')].groupby(['character']).character.count()\
                       .to_frame('total-character').sort_values(by='total-character')

character_Frank_Oz_years = character_Frank_Oz_years.loc[character_Frank_Oz_years['total-character'] > 2 ].sort_values(by='total-character',ascending=False)
character_Frank_Oz_years

                total-character
character
Animal                        6
Miss Piggy                    6
Yoda                          6
Sam the Eagle                 5
Fozzie Bear                   4
Cookie Monster                3
Bert                          3